#include <iostream>
#include <windows.h> // Για την χρήση του SetConsoleOutputCP ώστε να εμφανίζονται σωστά τα ελληνικά στην κονσόλα
#include "Library.h"
using namespace std;

int main() {
    SetConsoleOutputCP(CP_UTF8); /* Ορισμός του κωδικοποιητή για την σωστή εμφάνιση ελληνικών χαρακτήρων, 
                                    καθώς τα αρχεία κειμένου μπορεί να περιέχουν χαρακτήρες εκτός του ASCII */
    
    // Δημιουργία αντικειμένου βιβλιοθήκης
    Library lib;

    // Φόρτωση βιβλιοθήκης από αρχείο
    lib.loadFromFile("library.txt");

    int choice = -1;

    // Το κεντρικό μενού (τρέχει συνεχώς μέχρι ο χρήστης να επιλέξει να βγει)
    while (choice != 0) {
        cout << "\n========== ΜΕΝΟΥ ΒΙΒΛΙΟΘΗΚΗΣ ==========\n";
        cout << "1. Προσθήκη νέου βιβλίου\n";
        cout << "2. Προσθήκη αντιτύπου\n";
        cout << "3. Διαγραφή βιβλίου\n";
        cout << "4. Αναζήτηση βιβλίου (βάσει ISBN)\n";
        cout << "0. Έξοδος\n";
        cout << "=========================================\n";
        cout << "Επιλογή: ";
        cin >> choice;

        // Επεξεργασία της επιλογής του χρήστη και κλήση της αντίστοιχης λειτουργίας
        switch (choice) {
            case 1:
                cout << "Σε εξέλιξη...\n";
                break;
            case 2:
                cout << "Σε εξέλιξη...\n";
                break;
            case 3:
                cout << "Σε εξέλιξη...\n";
                break;
            case 4: {                   // Εύρεση βιβλίου βάσει ISBN
                string targetIsbn;
                cout << "Δώσε το ISBN του βιβλίου που ψάχνεις: ";
                cin >> targetIsbn;

                // Ψάχνουμε το βιβλίο με την findbook
                BookNode* b = lib.findBook(targetIsbn);

                // Εμφάνιση των στοιχείων του βιβλίου και των αντιτύπων του, εάν βρεθεί
                if (b == nullptr) {
                    cout << "Το βιβλίο με ISBN " << targetIsbn << " δεν βρέθηκε στη βιβλιοθήκη.\n";
                } else {        // Εάν το βιβλίο βρέθηκε, εμφανίζουμε τα στοιχεία του και τα αντίτυπα που έχει
                    cout << "\n--- Στοιχεία Βιβλίου ---\n";
                    cout << "Τίτλος: " << b->title << "\n";     // Εμφάνιση του τίτλου, του συγγραφέα και του ISBN του βιβλίου
                    cout << "Συγγραφέας: " << b->author << "\n";

                    cout << "--- Αντίγραφα ---\n";

                    // Διατρέχουμε τη λίστα των αντιτύπων του βιβλίου και τα εμφανίζουμε με τις πληροφορίες τους
                    CopyNode* currentCopy = b->copiesHead;
                    if (currentCopy == nullptr) {           // Εάν δεν υπάρχουν αντίτυπα, εμφανίζουμε μήνυμα ότι δεν υπάρχουν διαθέσιμα αντίτυπα
                        cout << "Δεν υπάρχουν καταχωρημένα αντίτυπα. \n";
                    } else {                                // Εάν υπάρχουν αντίτυπα, τα εμφανίζουμε με τις πληροφορίες τους
                        while (currentCopy != nullptr) {    // Διατρέχουμε τη λίστα των αντιτύπων
                            cout << " -> Κωδικός (ID): " << currentCopy->copyID 
                                 << " | Κατάσταση: " << currentCopy->status << "\n"; // Εμφάνιση του κωδικού και της κατάστασης κάθε αντιτύπου
                            currentCopy = currentCopy->next;                         // Προχωράμε στον επόμενο κόμβο της λίστας αντιτύπων
                        }
                    }
                }
                break;
            }
             // Εάν ο χρήστης επιλέξει 0, εμφανίζεται μήνυμα εξόδου και το πρόγραμμα τερματίζει 
            case 0:
                cout << "Έξοδος από το πρόγραμμα...\n";
                break;
            default:          // Εάν ο χρήστης εισάγει μια μη έγκυρη επιλογή, εμφανίζεται μήνυμα σφάλματος και το μενού εμφανίζεται ξανά
                cout << "Μη έγκυρη επιλογή. Παρακαλώ δοκιμάστε ξανά.\n";
                break;
        }      
            
    }

    return 0;
}